Autodesk.Revit.DB.Electrical.CableType.Duplicate
Duplicates this Cable Type.
Returns:
The duplicated Cable Type element.
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.Create(Autodesk.Revit.DB.Document)
Creates a Cable Type.
document:
The document where the new Cable Type will be created.
Returns:
The newly created Cable Type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.GetCableTypeId(Autodesk.Revit.DB.Document,System.String)
Gets the Cable Type id by given cable type name.
document:
The document.
name:
The Cable Type name.
Returns:
The Cable Type id. InvalidElementId will be returned if no Cable Type by given name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
name is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.GetCableTypeIds(Autodesk.Revit.DB.Document)
Gets all the Cable Types in the given document, sorted by name.
document:
The document.
Returns:
All the Cable Type ids in this document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.GetUsableCableSizeIds
Gets all the Cable Sizes that can be used by this Cable Type, sorted by name.
Returns:
All the Cable Size ids that can be used by this Cable Type.
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.IsCableSizeUsable(Autodesk.Revit.DB.ElementId)
Checks whether the Cable Size can be used by this Cable Type or not.
cableSizeId:
The Cable Size id.
Returns:
True if the Cable Size can be used by this Cable Type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a Cable Size id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.SetCableSizeUsable(Autodesk.Revit.DB.ElementId,System.Boolean)
Marks the Cable Size can be used by this Cable Type.
cableSizeId:
The Cable Size id.
usable:
The Cable Size can be used by this Cable Type or not.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The id is not a Cable Size id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.CoreType
The core type of the cable type.
Remarks:
It is single core by default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.InsulationMaterial
The Conductor Insulation Material of this Cable Type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a Conductor Insulation Material id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.ConductorMaterial
The Conductor Material of this Cable Type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a Conductor Material id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableType.TemperatureRating
The Conductor Temperature Rating of this Cable Type.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The id is not a Conductor Temperature Rating id nor invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.Electrical.CableType
This class represents a cable type.
Since:
2026